wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
#ifdef AMPLCDV11

#include "AMPLCDV11.H"



#include	"AMP_PHY.H"
//#include "AMP_LAY.H"
//#include "AMP_CABV11.H"

#include "STM32_SYS.H"
#include "STM32_GPIO.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_PWM.H"
#include "STM32_FLASH.H"

#include "LCD.H"
#include "ST7789V.H"

#include "font.h"




sAmpLcdDef	sAmpLcd;




unsigned  long*  MCUMEMaddr = (unsigned  long*)(0x1FFFF7E0);
unsigned  short  MCUMEMsize  = 0;

unsigned  char 	gCbFlag		=0;   //0--柜板，1--层板
unsigned	short FlashTime	=0;
unsigned	short Num=0;
//unsigned char testbuffer[]="GPIO_Configuration_OPP50(GPIOA,GPIO_Pin_0);";




/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPLCDV11_Configuration(void)
{	
	
	SYS_Configuration();				//系统配置
	
  GPIO_Configuration_OPP50(GPIOA,GPIO_Pin_0);
  
  PWM_OUT(TIM2,PWM_OUTChannel2,500,1);	//PWM设定-20161127版本	占空比1/1000
	
	//SysTick_DeleymS(500);				//SysTick延时nmS
	
  HW_Configuration(); 

	DataInitialize();	
  
  IWDG_Configuration(2000);													//独立看门狗配置---参数单位ms
	
	//SetBackColor(LCD565_DARKBLUE);
  ST7789V_Clean(0xFFFF);
	//AMPLCDV11GUI();
  SysTick_Configuration(1000);    //系统嘀嗒时钟配置72MHz,单位为uS  
  while(1)
  {
		AMPLCDV11_Receive();
		AMPLCDV11_Send();
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPLCDV11_Server(void)
{  
	static unsigned short color=0;
  FlashTime+=1;
	IWDG_Feed();								//独立看门狗喂狗
//	Tim_Server();
  if(FlashTime==2000)
  {
		FlashTime=0;
		#if 1==SelectModel
			DisplayManaStaticTest1();
		#elif 2==SelectModel
			DisplayManaStaticTest2();
		#elif 3==SelectModel
			DisplayManaModel1();
		#elif 4==SelectModel
			DisplayManaModel2();
		#elif 5==SelectModel
			DisplayManaModel3();
		#elif 6==SelectModel
			DisplayManaModel6();
		#endif
//		ST7789V_Clean(0xFFDE);
		//DisplayManaStaticTest1();
  }
  
}




//=================================软件接口End=============================================================




/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaStaticTest1(void)
{

}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaStaticTest2(void)
{

}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaModel1(void)
{

}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaModel2(void)
{

}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaModel3(void)
{

}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaModel3bac(void)
{

}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaModel6(void)
{
//	unsigned char i	=	0;
//	unsigned char len=0;
//	unsigned char num=0;
//	unsigned char size=0;
//	unsigned char offset=0;
//	unsigned char	buffer[256];
//	unsigned char* str;
//	
//	unsigned char TempLay	=	sAmpLcd.Sys.AddrLay%100;
//	unsigned char TempSeg	=	sAmpLcd.Sys.AddrSeg%100;
//	
//	unsigned short xs=0;
//	unsigned short ys=0;
//	unsigned short xe=0;
//	unsigned short ye=0;
//	unsigned short yebac=0;
//	
//	ListDef	DisplayData;		//
//	

//	if(0>=sAmpLcd.Display.ReceivedManaCount)	//没收到数据显示位置号
//	{		
//		ST7789V_PrintfBK(68,ST7789V_H/2-DisplayNumFtSize/2,DisplayNumFtSize,DisplayNumBkColor,DisplayNumFtColor,"层%0.2d    位%0.2d",TempLay,TempSeg);  //LCD显示测试Printf
//		return;
//	}
//	if(0==sAmpLcd.Display.DisplaySerial)
//	{
//		sAmpLcd.Display.DisplaySerial=1;
//	}
//	if(sAmpLcd.Display.DisplaySerial>sAmpLcd.Display.ReceivedManaCount)
//	{
//		sAmpLcd.Display.DisplaySerial=1;
//	}
//	
//	//=====================================清空区域:名称
//	xs	=	0;
//	xe	=	ST7789V_V;
//	ys	=	DisplayTopStartY;
//	ye	=	DisplayBotStartY;
//	
//	//ST7789V_Fill(xs,ys,xe,ye,DisplayClrColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)	
//	
//	//===============================顶部填充
//	ye=DisplayTopStartY;	
//	ST7789V_Fill(0,0,ST7789V_V,ye,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	//===============================中间分隔线填充
//	ys	=	(DisplayBotStartY-DisplayTopStartY-DisplayTitleSize-DisplaySeparWidth)/2+DisplayTopStartY+DisplayTitleSize;
//	ST7789V_Fill(0,ys-DisplaySeparWidth,ST7789V_V,ys+DisplaySeparWidth,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	
//	//===============================底部填充
//	ys	=	DisplayBotStartY;
//	ye	=	DisplayBotEndY;
//	ST7789V_Fill(0,ys,ST7789V_V,ST7789V_H,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	//===============================标题填充
//	ys	=	DisplayTopStartY;
//	ye	=	DisplayTopStartY+DisplayTitleSize;
//	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplayTitleBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	//===============================标题分隔线填充
//	ys	=	DisplayTopStartY+DisplayTitleSize;
//	ye	=	ys+DisplaySeparWidth;
//	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	
//	//===============================显示地址
//	ST7789V_PrintfBK(1,DisplayTopStartY,16,DisplayTitleBkColor,DisplayTitleFtColor,"层号:%0.2d 位号:%0.2d",TempLay,TempSeg);  //LCD显示测试Printf
//	//===============================显示起始
//	ys=DisplayTopStartY+DisplayTitleSize+DisplaySeparWidth+1;
//	
//	DisplayStart:
//	//-------------------------------第一行
//	for(i=0;i<sAmpLcd.Display.ReceivedManaCount;i++)
//	{
//		if(sAmpLcd.Display.DisplaySerial==sAmpLcd.Display.DisplayArry[i].ListNum)
//		{
//			unsigned char Sum			=	sAmpLcd.Display.ReceivedManaCount;
//			unsigned char Serial	=	sAmpLcd.Display.DisplaySerial;
//			
//			DisplayData=sAmpLcd.Display.DisplayArry[i];
//			
//			DisplaySetInfo(DisplayData);		//设置显示信息
//			DisplayName(DisplayData);				//显示名称
//			
//			DisplayNumber(DisplayData);			//显示数量和单位
//			
//			DisplayByName(DisplayData);			//显示别名
//			
//			DisplayVender(DisplayData);			//显示厂家名称
//			DisplaySpec(DisplayData);				//显示规格
//			DisplayCode(DisplayData);				//显示编码
////			DisplayNumber(DisplayData);			//显示数量和单位
//			sAmpLcd.Display.DisplaySerial+=1;	
//			break;
//		}		
//	}
//	if(sAmpLcd.Display.WinInfo.StartX<ST7789V_H/2)
//	{
//		goto DisplayStart;
//	}
}

