wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayName(const ListDef Node)
{
//	unsigned char i	=	0;
//	unsigned char len=0;
//	unsigned char num=0;
//	unsigned char size=0;
//	unsigned char offset=0;
//	unsigned char	buffer[256];
//	unsigned char* str;

//	unsigned short xs=0;
//	unsigned short ys=0;
//	unsigned short xe=0;
//	unsigned short ye=0;
//	unsigned short ysum=0;
//	unsigned short yebac=0;
//	unsigned short ValidX;		//水平有效使用点
//	unsigned short ValidY;		//垂直有效使用点
//	
//	unsigned short BackColor;	//背景色
//	unsigned short PenColor;	//画笔色
//	unsigned short FontSize;	//字体大小
//	
//	
//	//unsigned short DisplayNewStartY;
//	
//	
//	WinFontDef	WinFont	=	sAmpLcd.Display.WinFont;			//显示配置
//	WinInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
//	WinGuiDef		WinGui	=	sAmpLcd.Display.WinGui;
//	
//	BackColor	=	WinFont.FtName.BackColor;
//	PenColor	=	WinFont.FtName.PenColor;
//	FontSize	=	WinFont.FtName.Size;
//	
//	//-----------------------------------------------------检查有无数据
//	len=DisplayData.ParaName.len;	
//	if(0==len)
//	{
//		return;
//	}
//	//-----------------------------------------------------获取显示数据
//	len			=	DisplayData.ParaName.len;
//	offset	=	DisplayData.ParaName.Offset;	
//	memcpy(buffer,&DisplayData.String[offset],len);	
//	//-----------------------------------------------------清空显示区域
//	xs	=	WinInfo.PxyLeftFill.XH;	
//	xe	=	WinInfo.PxyRigthFill.XH;
//	
//	ys	=	WinGui.StartXY.YV;	
//	ye	=	ys+FontSize*WinInfo.PxyName.YV;
//	
//	ST7789V_Fill(xs,ys,xe,ye,BackColor);
//	
//	StartDisplay:
//	//-----------------------------------------------------获取显示区域(如果是单行则居中显示)
//	if((len*FontSize/2)<WinInfo.PxyValid.XH)
//	{
//		xs	=	WinInfo.PxyLeftFill.XH+((WinInfo.PxyValid.XH-(len*FontSize/2))/2);
//	}
//	else
//	{
//		xs	=	WinInfo.PxyLeftFill.XH;
//	}		
//	xe	=	WinInfo.PxyRigthFill.XH;
//	
//	ys	=	WinGui.StartXY.YV;	
//	ye	=	ys+FontSize*WinInfo.PxyName.YV;
//	//-----------------------------------------------------显示数据
//	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,len,buffer);	//带背景色限定区域显示
//	
//	WinGui.StartXY.YV=ye;
//	
//	sAmpLcd.Display.WinInfo	=	WinInfo;
//	sAmpLcd.Display.WinGui.StartXY.YV	=	WinGui.StartXY.YV;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayByName(const ListDef Node)
{
//	unsigned char i	=	0;
//	unsigned char len=0;
//	unsigned char num=0;
//	unsigned char size=0;
//	unsigned char offset=0;
//	unsigned char	buffer[256];
//	unsigned char str[]	=	"别名:";
//	unsigned char	strl;

//	unsigned short xs=0;
//	unsigned short ys=0;
//	unsigned short xe=0;
//	unsigned short ye=0;
//	unsigned short ysum=0;
//	unsigned short yebac=0;
//	unsigned short ValidX;		//水平有效使用点
//	unsigned short ValidY;		//垂直有效使用点
//	
//	unsigned short BackColor;	//背景色
//	unsigned short PenColor;	//画笔色
//	unsigned short FontSize;	//字体大小
//	
//	
//	WinFontDef	WinFont	=	sAmpLcd.Display.WinFont;			//显示配置
//	WinInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
//	WinGuiDef		WinGui	=	sAmpLcd.Display.WinGui;
//	
//	BackColor	=	WinFont.FtByName.BackColor;
//	PenColor	=	WinFont.FtByName.PenColor;
//	FontSize	=	WinFont.FtByName.Size;
//	
//	//-----------------------------------------------------检查有无数据
//	len=DisplayData.ParaByName.len;	
//	if(0==len)
//	{
//		return;
//	}
//	//-----------------------------------------------------获取显示数据
//	len			=	DisplayData.ParaByName.len;
//	offset	=	DisplayData.ParaByName.Offset;	
//	memcpy(buffer,&DisplayData.String[offset],len);	
//	
//	//-----------------------------------------------------获取显示区域
//	strl	=	strlen(str);	
//	memcpy(buffer,str,strl);
//	offset	=	DisplayData.ParaByName.Offset;
//	
//	len	=	DisplayData.ParaByName.len;
//	memcpy(&buffer[strl],&DisplayData.String[offset],len);
//	
//	len+=strl;
//	
//	//-----------------------------------------------------清空显示区域
//	xs	=	WinInfo.PxyLeftFill.XH;	
//	//xe	=	WinConf.WinEndX;
//	xe	=	xs+FontSize*WinInfo.PxyByName.XH/2;
//	
//	ys	=	WinGui.StartXY.YV;	
//	ye	=	ys+FontSize*WinInfo.PxyByName.YV;
//	
//	ST7789V_Fill(xs,ys,xe,ye,BackColor);
//	
//	StartDisplay:
//	//-----------------------------------------------------显示数据
//	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,len,buffer);	//带背景色限定区域显示
//	
//	WinGui.StartXY.YV=ye;
//	
//	sAmpLcd.Display.WinInfo	=	WinInfo;
//	sAmpLcd.Display.WinGui.StartXY.YV	=	WinGui.StartXY.YV;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayVender(const ListDef Node)
{
//	unsigned char i	=	0;
//	unsigned char len=0;
//	unsigned char num=0;
//	unsigned char size=0;
//	unsigned char offset=0;
//	unsigned char	buffer[256];
//	unsigned char str[]	=	"厂家:";
//	unsigned char	strl;

//	unsigned short xs=0;
//	unsigned short ys=0;
//	unsigned short xe=0;
//	unsigned short ye=0;
//	unsigned short ysum=0;
//	unsigned short yebac=0;
//	unsigned short ValidX;		//水平有效使用点
//	unsigned short ValidY;		//垂直有效使用点
//	
//	unsigned short BackColor;	//背景色
//	unsigned short PenColor;	//画笔色
//	unsigned short FontSize;	//字体大小
//	

//	
//	
//	WinFontDef	WinFont	=	sAmpLcd.Display.WinFont;			//显示配置
//	WinInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
//	WinGuiDef		WinGui	=	sAmpLcd.Display.WinGui;
//	
//	BackColor	=	WinFont.FtVender.BackColor;
//	PenColor	=	WinFont.FtVender.PenColor;
//	FontSize	=	WinFont.FtVender.Size;
//	//-----------------------------------------------------检查有无数据
//	len=DisplayData.ParaVender.len;	
//	if(0==len)
//	{
//		return;
//	}	
//	
//	//-----------------------------------------------------获取显示区域
//	strl	=	strlen(str);	
//	memcpy(buffer,str,strl);
//	offset	=	DisplayData.ParaVender.Offset;
//	
//	len	=	DisplayData.ParaVender.len;
//	memcpy(&buffer[strl],&DisplayData.String[offset],len);
//	
//	len+=strl;
//	
//	goto StartDisplayVender;
//	
//	//==========================================判断起始点在中线上还是下
//	//==========================================开始显示商品名称
//	StartDisplayVender:
//	
//	xs	=	WinInfo.PxyLeftFill.XH;
//	xe	=	xs+FontSize*WinInfo.PxyVender.XH/2;
//	
//	ys	=	WinGui.StartXY.YV;
//	
//	if(0!=len%WinInfo.PxyVender.XH)
//	{
//		ye	=	ys+FontSize*(len/WinInfo.PxyVender.XH+1);
//	}
//	else
//	{
//		ye	=	ys+FontSize*WinInfo.PxyVender.YV;
//	}	
//	//-----------------------------------------------------背景填充
//	ST7789V_Fill(xs,ys,xe,ye,BackColor);
//	//-----------------------------------------------------显示数据
//	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,len,buffer);	//带背景色限定区域显示
//	
//	WinGui.StartXY.YV=ye;
//	
//	sAmpLcd.Display.WinInfo	=	WinInfo;
//	sAmpLcd.Display.WinGui.StartXY.YV	=	WinGui.StartXY.YV;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplaySpec(const ListDef Node)
{
//	unsigned char i	=	0;
//	unsigned char len=0;
//	unsigned char num=0;
//	unsigned char size=0;
//	unsigned char offset=0;
//	unsigned char	buffer[256];
//	unsigned char str[]	=	"规格:";
//	unsigned char	strl;

//	unsigned short xs=0;
//	unsigned short ys=0;
//	unsigned short xe=0;
//	unsigned short ye=0;
//	unsigned short ysum=0;
//	unsigned short yebac=0;
//	unsigned short ValidX;		//水平有效使用点
//	unsigned short ValidY;		//垂直有效使用点
//	
//	unsigned short BackColor;	//背景色
//	unsigned short PenColor;	//画笔色
//	unsigned short FontSize;	//字体大小
//	

//	
//	
//	WinFontDef	WinFont	=	sAmpLcd.Display.WinFont;			//显示配置
//	WinInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
//	WinGuiDef		WinGui	=	sAmpLcd.Display.WinGui;
//	
//	BackColor	=	WinFont.FtSpec.BackColor;
//	PenColor	=	WinFont.FtSpec.PenColor;
//	FontSize	=	WinFont.FtSpec.Size;
//	//-----------------------------------------------------检查有无数据
//	len=DisplayData.ParaSpec.len;	
//	if(0==len)
//	{
//		return;
//	}
//	
//	//-----------------------------------------------------获取显示区域	
//	//len			=	WinInfo.LineCoSpec*WinInfo.RowCoSpec;
//	len=DisplayData.ParaSpec.len;

//	strl	=	strlen(str);	
//	memcpy(buffer,str,strl);
//	offset	=	DisplayData.ParaSpec.Offset;
//	
//	memcpy(&buffer[strl],&DisplayData.String[offset],len);
//	
//	len+=strl;
//	
//	goto StartDisplaySpec;
//	
//	//==========================================判断起始点在中线上还是下
//	//==========================================开始显示商品名称
//	StartDisplaySpec:
//	
//	xs	=	WinInfo.PxyLeftFill.XH;
//	xe	=	xs+FontSize*WinInfo.PxySpec.XH/2;
//	
//	ys	=	WinGui.StartXY.YV;
//	
//	if(0!=len%WinInfo.PxySpec.XH)
//	{
//		ye	=	ys+FontSize*(len/WinInfo.PxySpec.XH+1);
//	}
//	else
//	{
//		ye	=	ys+FontSize*WinInfo.PxySpec.YV;
//	}	
//	//-----------------------------------------------------背景填充
//	ST7789V_Fill(xs,ys,xe,ye,BackColor);
//	//-----------------------------------------------------显示数据
//	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,len,buffer);	//带背景色限定区域显示
//	
//	WinGui.StartXY.YV=ye;
//	
//	sAmpLcd.Display.WinInfo	=	WinInfo;
//	sAmpLcd.Display.WinGui.StartXY.YV	=	WinGui.StartXY.YV;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayCode(const ListDef Node)
{
//	unsigned char i	=	0;
//	unsigned char len=0;
//	unsigned char num=0;
//	unsigned char size=0;
//	unsigned char offset=0;
//	unsigned char	buffer[256];
//	unsigned char str[]	=	"编码:";
//	unsigned char	strl;

//	unsigned short xs=0;
//	unsigned short ys=0;
//	unsigned short xe=0;
//	unsigned short ye=0;
//	unsigned short ysum=0;
//	unsigned short yebac=0;
//	unsigned short ValidX;		//水平有效使用点
//	unsigned short ValidY;		//垂直有效使用点
//	
//	unsigned short BackColor;	//背景色
//	unsigned short PenColor;	//画笔色
//	unsigned short FontSize;	//字体大小
//	

//	
//	
//	WinFontDef	WinFont	=	sAmpLcd.Display.WinFont;			//显示配置
//	WinInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
//	WinGuiDef		WinGui	=	sAmpLcd.Display.WinGui;
//	
//	BackColor	=	WinFont.FtCode.BackColor;
//	PenColor	=	WinFont.FtCode.PenColor;
//	FontSize	=	WinFont.FtCode.Size;
//	
//	//-----------------------------------------------------检查有无数据
//	len=DisplayData.ParaCode.len;	
//	if(0==len)
//	{
//		return;
//	}
//	//-----------------------------------------------------获取显示区域	
//	len			=	WinInfo.PxyCode.XH*WinInfo.PxyCode.YV;
//	if(DisplayData.ParaSpec.len<len)
//	{
//		len=DisplayData.ParaCode.len;
//	}
//	strl	=	strlen(str);	
//	memcpy(buffer,str,strl);
//	offset	=	DisplayData.ParaCode.Offset;
//	
//	memcpy(&buffer[strl],&DisplayData.String[offset],len);
//	
//	len+=strl;
//	
//	goto StartDisplay;
//	
//	//==========================================判断起始点在中线上还是下
//	//==========================================开始显示商品名称
//	StartDisplay:
//	
//	xs	=	WinInfo.PxyLeftFill.XH;
//	xe	=	xs+FontSize*WinInfo.PxyCode.XH/2;
//	
//	ys	=	WinGui.StartXY.YV;
//	
//	if(0!=len%WinInfo.PxyCode.XH)
//	{
//		ye	=	ys+FontSize*(len/WinInfo.PxyCode.XH+1);
//	}
//	else
//	{
//		ye	=	ys+FontSize*WinInfo.PxyCode.YV;
//	}	
//	//-----------------------------------------------------背景填充
//	ST7789V_Fill(xs,ys,xe,ye,BackColor);
//	//-----------------------------------------------------显示数据
//	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,len,buffer);	//带背景色限定区域显示
//	
//	WinGui.StartXY.YV=ye;
//	
//	sAmpLcd.Display.WinInfo	=	WinInfo;
//	sAmpLcd.Display.WinGui.StartXY.YV	=	WinGui.StartXY.YV;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayNumber(const ListDef Node)
{
//	unsigned char i	=	0;
//	unsigned char len=0;
//	unsigned char num=0;
//	unsigned char size=0;
//	unsigned char offset=0;
//	unsigned char	buffer[256];
//	unsigned char* str;
//	unsigned char	strl;

//	unsigned short xs=0;
//	unsigned short ys=0;
//	unsigned short xe=0;
//	unsigned short ye=0;
//	unsigned short ysum=0;
//	unsigned short yebac=0;
//	unsigned short ValidX;		//水平有效使用点
//	unsigned short ValidY;		//垂直有效使用点
//	
//	unsigned short BackColor;	//背景色
//	unsigned short PenColor;	//画笔色
//	unsigned short FontSize;	//字体大小
//	

//	
//	
//	WinFontDef	WinFont	=	sAmpLcd.Display.WinFont;			//显示配置
//	WinInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
//	WinGuiDef		WinGui	=	sAmpLcd.Display.WinGui;
//	
//	BackColor	=	WinFont.FtNum.BackColor;
//	PenColor	=	WinFont.FtNum.PenColor;
//	FontSize	=	WinFont.FtNum.Size;
//	//DisplayNewStartY	=	sAmpLcd.Display.DisplayNextStartY;	
//	//-----------------------------------------------------检查有无数据
////	len=DisplayData.LenNum;	
////	if(0==len)
////	{
////		return;
////	}
//	
//	//-----------------------------------------------------获取显示区域
//	str	=	buffer;	
//	len=DisplayData.ParaNum.len;
//	offset	=	DisplayData.ParaNum.Offset;	
//	memcpy(str,&DisplayData.String[offset],len);
//	
//	str	=	&buffer[len];	
//	len	=	DisplayData.ParaUnit.len;
//	offset	=	DisplayData.ParaUnit.Offset;
//	memcpy(str,&DisplayData.String[offset],len);

//	goto StartDisplay;
//	
//	//==========================================判断起始点在中线上还是下
//	//==========================================开始显示商品名称
//	StartDisplay:
////	ysum	=	WinInfo.RowCoSpec*WinConf.WinSpecFtSize+WinInfo.RowCoCode*WinConf.WinCodeFtSize+WinInfo.RowCoVender*WinConf.WinVenderFtSize;
//	len	=	DisplayData.ParaNum.len+DisplayData.ParaUnit.len;
//	xs	=	WinInfo.PxyLeftFill.XH+(WinInfo.PxyValid.XH-len*FontSize/2);
//	xe	=	xs+FontSize*len/2;
//	
//	//ys	=	WinInfo.StartY-FontSize;
//	ys	=	WinGui.StartXY.YV+4;
//	ye	=	ys+FontSize;
//	//-----------------------------------------------------背景填充
//	ST7789V_Fill(xs,ys,xe,ye,BackColor);
//	//-----------------------------------------------------显示数据
//	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,len,buffer);	//带背景色限定区域显示
//	
//	//WinInfo.StartY=ye;
//	
//	sAmpLcd.Display.WinInfo	=	WinInfo;
//	sAmpLcd.Display.WinGui.StartXY.YV	=	WinGui.StartXY.YV;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void SetBackColor(unsigned short BKColor)
{
//	if(sAmpLcd.Display.LcdPort.ST7789VBColor	!=	BKColor)
//	{
//		STM32_FLASH_Write(BackColorStartAddr,(unsigned short*)&BKColor,1);						//从指定地址写入指定长度的数据
//		BKColor	=	GetBackColor();
//		sAmpLcd.Display.LcdPort.ST7789VBColor=BKColor;
//	}	
//	ST7789V_Clean(BKColor);	//清除屏幕函数
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short GetBackColor(void)
{
	unsigned short BKColor;
	STM32_FLASH_Read(BackColorStartAddr,(unsigned short*)&BKColor,1);							//从指定地址开始读出指定长度的数据
	return	BKColor;
}

