wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
	ReceiveDataCheckStart:	//开始检测接收到的数据
  //-------------------------协议检查
  ampframe	=	(stampphydef*)API_AmpCheckFrame(StartAddr,&framlength);    //判断帧消息内容是否符合协议
  if(NULL== ampframe)
  {
    return;		//退出，未检测到有效的帧
  }
  //-------------------------检查是否为应答帧
	if(AmpCmdAck==ampframe->msg.cmd.cmd)
	{
		goto ReCheckData;		//重新检测剩余的数据
	}
  //-------------------------层地址检查
	if(sAmpLcd.Sys.AddrLay	!=	ampframe->msg.addr.address2)
	{
		goto ReCheckData;		//重新检测剩余的数据
	}
	//-------------------------位地址检查
	if(sAmpLcd.Sys.AddrSeg	!=	ampframe->msg.addr.address3)
	{
		goto ReCheckData;		//重新检测剩余的数据
	}
 
  //-------------------------下发数据
  if(0  ==  ampframe->msg.cmd.dir)	//最高位为0表示上往下发
  {
    //---------------------------显示数据命令
    if(AmpCmdLcdData ==  ampframe->msg.cmd.cmd) 
    {	
			unsigned char* buffer=NULL;
			DataLen	=	ampframe->msg.length-4;		//数据段长度			
			buffer=(unsigned char*)ampframe->msg.data;
			
			PackManaData:
			GetManaData(buffer,DataLen);
			AMPLCDV11_Ack();						
    }
		//---------------------------修改背景色命令--只带2字节数据,低8位颜色在前
		else if(AmpCmdLcdConf ==  ampframe->msg.cmd.cmd)
		{
			unsigned short BackColor	=	0;			
			memcpy(&BackColor,ampframe->msg.data,2);	//2字节背景色数据，低位在前
			SetBackColor(BackColor);
			AMPLCDV11_Ack();			
		}
		goto ReCheckData;		//重新检测剩余的数据
  }
	//------------------------------继续检查剩余数据，直到检查失败
	ReCheckData:
	StartAddr=(unsigned char*)&ampframe[1];
	framlength-=1;	//去掉一字节长度
	goto ReceiveDataCheckStart;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void GetManaData(const unsigned char* Databuffer,unsigned short datalen)
{
	unsigned char		i=0;
	unsigned char 	strtype		=0;		//字符串类型
	unsigned char 	strLen		=0;		//字符串长度
//	unsigned char 	strCount	=0;		//已处理的字符串个数计数
	unsigned char 	FinishedDataLen	=	0;	//已处理数据个数
	unsigned char		Offset			=	0;	//下一个类型字符串的偏移地址
	unsigned char*	ParaOffsetAddr;		//字符串地址偏移指针
	unsigned char*	ParalenAddr;			//字符串长度指针
	
	unsigned char		MaxList		=	0;
//	unsigned char		ListCount	=	0;
	
	unsigned char* 	pSource;		//源字符串地址---源自串口接收到的数据
	unsigned char* 	pTarget;		//目标符串地址---存储
	
	ManaDef*	ManaData;
	ListDef*	List;		//
//	ListDef*	pNode;
	ListDef		Node;
	
	//=================================初始化数据
	List			=	sAmpLcd.Windows.ManaData.List;
	MaxList		=	sAmpLcd.Windows.ManaData.MaxNameList;	//可接收的最大条目限制
	memset(&Node,0x00,sizeof(ListDef));
	//=================================查找空缓存
	for(i=0;i<MaxList;i++)
	{
		if(0==List[i].ListNum)		//缓存为空，可以拷贝数据
		{
			break;
		}
	}	
	//=================================未查找到空缓存，缓存满
	if(i>=DspMaxNameTypeCount)
	{
		return;
	}
	//=================================分类拆装数据
	//---------------------------------初始化指针地址和数据
	ManaData	=	(ManaDef*)Databuffer;
	pSource		=	ManaData->String;			//数据源地址
	pTarget		=	Node.String;				//数据目标地址
	//---------------------------------01名称参数
	strtype		=	ManaData->type;
	strLen		=	ManaData->len;
	if(strLen+2>AMPLcdMaxStringLen)	//字符个数超限(字符串+type和len)
		return;
	
	GetDataStart:
	switch(strtype)	//字符串类型判断
	{
		case	0x01:	//商品名类型
			if(0!=Node.ParaName.len)	//数据异常
			{
				return;
			}
			ParaOffsetAddr	=	&Node.ParaName.Offset;
			ParalenAddr			=	&Node.ParaName.len;
		break;
		case	0x02:	//规格参数
			if(0!=Node.ParaSpec.len)	//数据异常
			{
				return;
			}
			ParaOffsetAddr	=	&Node.ParaSpec.Offset;
			ParalenAddr			=	&Node.ParaSpec.len;		
		break;
		case	0x03:	//数量参数
			if(0!=Node.ParaNum.len)	//数据异常
			{
				return;
			}
			ParaOffsetAddr	=	&Node.ParaNum.Offset;
			ParalenAddr			=	&Node.ParaNum.len;		
		break;
		
		case	0x04:	//别名
			if(0!=Node.ParaByName.len)	//数据异常
			{
				return;
			}
			ParaOffsetAddr	=	&Node.ParaByName.Offset;
			ParalenAddr			=	&Node.ParaByName.len;			
		break;
		case	0x05:	//厂商名称
			if(0!=Node.ParaVender.len)	//数据异常
			{
				return;
			}
			ParaOffsetAddr	=	&Node.ParaVender.Offset;
			ParalenAddr			=	&Node.ParaVender.len;
		break;
		case	0x06:	//商品编码
			if(0!=Node.ParaCode.len)	//数据异常
			{
				return;
			}
			ParaOffsetAddr	=	&Node.ParaCode.Offset;
			ParalenAddr			=	&Node.ParaCode.len;
		break;
		case	0x07:	//数量单位
			if(0!=Node.ParaUnit.len)	//数据异常
			{
				return;
			}
			ParaOffsetAddr	=	&Node.ParaUnit.Offset;
			ParalenAddr			=	&Node.ParaUnit.len;
		break;
		default:return;	//未找到类型数据
	}
	*ParalenAddr		=	strLen;		//字符串长度
	*ParaOffsetAddr	=	Offset;		//当前字符串偏移地址

	//-------------------------------复制数据
	memcpy(pTarget,pSource,strLen);		//复制字符串
	
	//-------------------------------统计已处理字节数
	Offset		=	Offset+strLen;				//下一个类型字符串的偏移地址
	FinishedDataLen+=strLen+2;							//已处理数据个数(字符串+type和len)
	//-------------------------------指向下一类型
	if(FinishedDataLen>=datalen)	//已处理完
	{
		//-------------------------------正确获取到数据
		if(0!=Node.ParaName.len||0!=Node.ParaByName.len)	//商品名称或者别名是必需数据
		{
			SetManaData(&Node);														//设置显示参数---数据获取成功后设置相关的显示参数
//			sAmpLcd.Windows.ManaData.ReceivedManaCount+=1;
//			pNode->ListNum	=	i+1;
		}
		return;
	}
	//-------------------------------指向下一类型	
	ManaData	=	(ManaDef*)&pSource[strLen];
	pSource		=	ManaData->String;		//新源字符串地址
	pTarget		=	&pTarget[strLen];		//新目标字符串地址
	strtype		=	ManaData->type;
	strLen		=	ManaData->len;
	//-------------------------------剩下字符重新做类型检查
	if(FinishedDataLen+strLen>AMPLcdMaxStringLen)	//字符个数超限
		return;
	goto GetDataStart;
	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	设置显示参数---数据获取成功后设置相关的显示参数
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void SetManaData(ListDef* pNode)
{
	unsigned char		i=0;
	unsigned char 	strtype		=	0;		//字符串类型
	unsigned char 	strLen		=	0;		//字符串长度
	unsigned char		FontSize	=	0;		//字体大小16,24,32
	unsigned char		Line			=	0;		//可显示行数
//	unsigned char 	strCount	=0;		//已处理的字符串个数计数
	unsigned char 	FinishedDataLen	=	0;	//已处理数据个数
	unsigned char		Offset			=	0;	//下一个类型字符串的偏移地址
	unsigned char*	ParaOffsetAddr;		//字符串地址偏移指针
	unsigned char*	ParalenAddr;			//字符串长度指针
	
	unsigned char		MaxList		=	0;
	unsigned char		ListCount	=	0;
	
	unsigned char* 	pSource;		//源字符串地址---源自串口接收到的数据
	unsigned char* 	pTarget;		//目标符串地址---存储
	
	unsigned short	XH;						//X--水平占用点数
	unsigned short	YV;						//Y--垂直占用点数
	unsigned short	OffsetXH;			//X--数量和单位点用的水平点数
	
