wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
	unsigned short*	pTargetXH;		//X--数据水平有效点数地址
	unsigned short*	pTargetYV;		//Y--数据垂直有效点数地址
	
	unsigned short	ValidXH;			//X--水平有效点数
	unsigned short	ValidYV;			//Y--垂直有效点数
	
	ParaDef*		Para;
	ListDef*		List;
	ListDef			Node;
	WinFontDef	WinFont;			//显示字体信息
	//---------------------------------输入数据地址有效性
	if(NULL==pNode)
	{
		return;
	}
	//---------------------------------检查数据有效性
	if((0==pNode->ParaName.len)&&(0==pNode->ParaByName.len))	//商品名称或者别名是必需数据
	{
		return;
	}
	//=================================初始化数据
	List		=	sAmpLcd.Windows.ManaData.List;
	MaxList	=	sAmpLcd.Windows.ManaData.MaxNameList;	//可接收的最大条目限制
	WinFont	=	sAmpLcd.Windows.WinFont;							//字体信息
	ValidXH	=	sAmpLcd.Windows.WinInfo.PxyValid.XH;
	ValidYV	=	sAmpLcd.Windows.WinInfo.PxyValid.YV;
	
	Node	=	*pNode;
	//=================================先计算数量和单位占用X点数(除名称外，右缩进需要根据数量和单位占用的X点数来调整)
	//---------------------------------获取数量和单位数据
	FontSize	=	WinFont.FtNum.Size;
	strLen		=	Node.ParaNum.len+Node.ParaUnit.len;		//数量和单位的字节点
	//---------------------------------计算数量占用水平点数
	Node.ParaNum.XH	=	Node.ParaNum.len*(FontSize/2);	//字符宽度为高度的一半
	Node.ParaNum.YV	=	Node.ParaNum.len*(FontSize);		//字符宽度为高度的一半
	//---------------------------------计算单位占用水平点数
	Node.ParaUnit.XH	=	Node.ParaUnit.len*(FontSize/2);	//字符宽度为高度的一半
	Node.ParaUnit.YV	=	Node.ParaUnit.len*(FontSize);		//字符宽度为高度的一半
	//----------------------------------数量和单位共占用的水平点数
	OffsetXH	=	Node.ParaNum.XH+Node.ParaUnit.XH;	
	
	//=================================分类拆装数据
	//---------------------------------初始化指针地址和数据
	Para	=	(ParaDef*)&Node.ParaName;

	//---------------------------------01名称参数
	strtype		=	0x01;		//从第一个参数开始


	SetDataStart:
	switch(strtype)
	{
		case	0x01:	//商品名类型
			Line	=	4;		//名称最大可显示4行
			strLen		=	Node.ParaName.len;			
			FontSize	=	WinFont.FtName.Size;		
			Node.ParaName.XH	=	sAmpLcd.Windows.WinInfo.PxyValid.XH;
			
			pTargetXH	=	&Node.ParaName.XH;
			pTargetYV	=	&Node.ParaName.YV;
		break;
		case	0x02:	//规格参数
			Line	=	2;		//名称最大可显示2行
			strLen		=	Node.ParaSpec.len;			
			FontSize	=	WinFont.FtSpec.Size;		
			Node.ParaName.XH	=	sAmpLcd.Windows.WinInfo.PxyValid.XH-OffsetXH;
		
			pTargetXH	=	&Node.ParaSpec.XH;
			pTargetYV	=	&Node.ParaSpec.YV;
		break;
		case	0x03:	//数量参数
			strtype+=1;
			goto SetDataStart;	
		break;
		
		case	0x04:	//别名
			Line	=	2;		//名称最大可显示2行
			strLen		=	Node.ParaByName.len;			
			FontSize	=	WinFont.FtByName.Size;		
			Node.ParaByName.XH	=	sAmpLcd.Windows.WinInfo.PxyValid.XH-OffsetXH;
		
			pTargetXH	=	&Node.ParaByName.XH;
			pTargetYV	=	&Node.ParaByName.YV;			
		break;
		case	0x05:	//厂商名称
			Line	=	2;		//名称最大可显示2行
			strLen		=	Node.ParaVender.len;			
			FontSize	=	WinFont.FtVender.Size;		
			Node.ParaVender.XH	=	sAmpLcd.Windows.WinInfo.PxyValid.XH-OffsetXH;
		
			pTargetXH	=	&Node.ParaVender.XH;
			pTargetYV	=	&Node.ParaVender.YV;
		break;
		case	0x06:	//商品编码
			Line	=	2;		//名称最大可显示2行
			strLen		=	Node.ParaCode.len;			
			FontSize	=	WinFont.FtCode.Size;		
			Node.ParaCode.XH	=	sAmpLcd.Windows.WinInfo.PxyValid.XH-OffsetXH;
		
			pTargetXH	=	&Node.ParaCode.XH;
			pTargetYV	=	&Node.ParaCode.YV;
		break;
		case	0x07:	//数量单位
			strtype+=1;
			goto SetDataStart;
		break;
		default:return;	//未找到类型数据
	}
}
/*******************************************************************************
*函数名			:	DataInitialize
*功能描述		:	数据初始化
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DataInitialize(void)
{
	unsigned	char*	addr;
	//==========================================显示参数初始化
	WinFontDef* WinFont	=	(WinFontDef*)&sAmpLcd.Windows.WinFont;
	WinInfoDef* WinInfo	=	(WinInfoDef*)&sAmpLcd.Windows.WinInfo;
	//==========================================WinFont
	WinFont->FtDefault.BackColor	=	DisplayBackColor;
	WinFont->FtDefault.PenColor		=	DisplayFontColor;
	WinFont->FtDefault.Size				=	DisplayFontSize;
	
	WinFont->FtName.BackColor			=	DisplayNameBkColor;
	WinFont->FtName.PenColor			=	DisplayNameFtColor;
	WinFont->FtName.Size					=	DisplayNameFtSize;
	
	WinFont->FtByName.BackColor		=	DisplayByNameBkColor;
	WinFont->FtByName.PenColor		=	DisplayByNameFtColor;
	WinFont->FtByName.Size				=	DisplayByNameFtSize;
	
	WinFont->FtSpec.BackColor			=	DisplaySpecBkColor;
	WinFont->FtSpec.PenColor			=	DisplaySpecFtColor;
	WinFont->FtSpec.Size					=	DisplaySpecFtSize;
	
	WinFont->FtNum.BackColor			=	DisplayNumBkColor;
	WinFont->FtNum.PenColor				=	DisplayNumFtColor;
	WinFont->FtNum.Size						=	DisplayNumFtSize;
	
	WinFont->FtSeril.BackColor		=	DisplaySerialBkColor;
	WinFont->FtSeril.PenColor			=	DisplaySerialFtColor;
	WinFont->FtSeril.Size					=	DisplaySerialFtSize;
	
	WinFont->FtCode.BackColor			=	DisplayCodeBkColor;
	WinFont->FtCode.PenColor			=	DisplayCodeFtColor;
	WinFont->FtCode.Size					=	DisplayCodeFtSize;
	
	WinFont->FtVender.BackColor		=	DisplayVenderBkColor;
	WinFont->FtVender.PenColor		=	DisplayVenderFtColor;
	WinFont->FtVender.Size				=	DisplayVenderFtSize;
	
	WinFont->FtTitle.BackColor		=	DisplayTitleBkColor;
	WinFont->FtTitle.PenColor			=	DisplayTitleFtColor;
	WinFont->FtTitle.Size					=	DisplayTitleSize;
	
	WinFont->FtSepar.BackColor		=	DisplaySeparBkColor;
	WinFont->FtSepar.Size					=	DisplaySeparWidth;
	
	//==========================================WinInfo
	//------------------------------------------整屏像素点
	WinInfo->PxyPixel.XH					=	ST7789V_V;		//水平点个数
	WinInfo->PxyPixel.YV					=	ST7789V_H;		//垂直点个数
	
	//------------------------------------------顶端垂直起始/填充点
	WinInfo->PxyTopFill.XH				=	0;
	WinInfo->PxyTopFill.YV				=	DisplayTopStartY;	
	//------------------------------------------底部垂直起始/填充点
	WinInfo->PxyBotFill.XH				=	0;
	WinInfo->PxyBotFill.YV				=	DisplayBotStartY;
	//------------------------------------------左边起始/填充点
	WinInfo->PxyLeftFill.XH				=	DisplayStartX;
	WinInfo->PxyLeftFill.YV				=	0;
	//------------------------------------------剩余有效使用点数
	WinInfo->PxyValid.XH					=	WinInfo->PxyPixel.XH-WinInfo->PxyLeftFill.XH;
	WinInfo->PxyValid.YV					=	WinInfo->PxyBotFill.YV-WinInfo->PxyTopFill.YV;
	
	//------------------------------------------最大可以接收商品个数
	addr=(unsigned char*)&sAmpLcd.Windows.ManaData.MaxNameList;
	*addr	=	DspMaxNameTypeCount;
}
#endif
